export default {
  home: {
    aiMode: "هوش مصنوعی",
    humanMode: "کنترل دستی",
    emergency: "مود اضطراری",
    settings: "تنظیمات",
    theme: "تم:",
    dark: "تیره",
    light: "روشن",
    joystick: "جوی‌استیک:",
    ps4: "پلی‌استیشن ۴",
    ps5: "پلی‌استیشن ۵",
    info: "اطلاعات",
    version: "نسخه",
    hotspot: "تنظیمات هات‌اسپات",
    robot: "ربات",
    connect: "اتصال",
    copyright: "کپی‌رایت",
    description: `تینکو مخفف Triad Intelligence Nexus Centipede Operation است؛
      یک پروژه چندبخشی برای ساخت ربات هزارپای هوشمند، کنترل‌پذیر و توسعه‌پذیر.
      این ربات با ترکیب هوش مصنوعی، پردازش تصویر و فناوری‌های ارتباطی مدرن طراحی شده است.
      کاربردهای آن می‌تواند شامل پایش محیطی، عملیات امداد و نجات، آموزش رباتیک و حتی سرگرمی‌های علمی باشد.
      هدف نهایی ایجاد بستری است که هم برای پژوهشگران و هم برای کاربران عادی قابل استفاده و توسعه باشد.`
  },
  emergency: {
    title: "حالت اضطراری",
    description: `⚠️ حالت اضطراری: در شرایط بحرانی ربات وارد وضعیت اضطراری می‌شود.
🔋 باتری کم – وقتی سطح انرژی به شدت کاهش یابد، سیستم اولویت را به خاموشی ایمن یا بازگشت می‌دهد.
🧭 گم کردن مسیر – اگر ربات مسیر یا جهت خود را از دست بدهد، پروتکل‌های اضطراری فعال می‌شوند.
↩️ بازگشت به عقب – ربات می‌تواند مسیر خود را به عقب برگردد تا به مکان امن برسد.
🤖 در همه موارد، هوش مصنوعی تصمیم می‌گیرد کدام گزینه بهترین پاسخ است.`,
    enabled: "فعال",
    disabled: "غیرفعال",
  },
  ai: {
    forward: "حرکت به جلو",
    backward: "حرکت به عقب",
    turn: "چرخش ۹۰ درجه",
    forwardTurn: "حرکت به جلو و چرخش ۹۰ درجه",
    jump: "پرش",
  }
}
